## SQL Analysis using PostgreSQL (Online Retail Cleaned Data)

### Connect to PostgreSQL

In [1]:
pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in c:\users\asus\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: psycopg2-binary in c:\users\asus\anaconda3\lib\site-packages (2.9.10)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\asus\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
engine = create_engine('postgresql://postgres:postgres123@localhost:5432/retail_db')

In [4]:
df = pd.read_csv('OnlineRetail_Clean.csv', dtype={'InvoiceNo': str})
df.columns = df.columns.str.lower()
df.to_sql('online_retail_data', engine, if_exists='replace', index=False)

909

### 2. SQL Queries

In [5]:
pd.read_sql("SELECT * FROM online_retail_data LIMIT 1;", engine).columns

Index(['invoiceno', 'stockcode', 'description', 'quantity', 'invoicedate',
       'unitprice', 'customerid', 'country', 'revenue', 'yearmonth',
       'iscancelled'],
      dtype='object')

In [6]:
# Query 1: Top 10 Products by Revenue
pd.read_sql("""
SELECT description, ROUND(SUM(revenue)::numeric, 2) AS total_revenue
FROM online_retail_data
WHERE iscancelled = false
GROUP BY description
ORDER BY total_revenue DESC
LIMIT 10;
""", engine)

                          description  total_revenue
0                      DOTCOM POSTAGE      206248.77
1            REGENCY CAKESTAND 3 TIER      174484.74
2         PAPER CRAFT , LITTLE BIRDIE      168469.60
3  WHITE HANGING HEART T-LIGHT HOLDER      106292.77
4                       PARTY BUNTING       99504.33
5             JUMBO BAG RED RETROSPOT       94340.05
6      MEDIUM CERAMIC TOP STORAGE JAR       81700.92
7                              Manual       78112.82
8                             POSTAGE       78101.88
9                  RABBIT NIGHT LIGHT       66964.99

In [7]:
# Query 2: Orders per Country
pd.read_sql("""
SELECT country, COUNT(DISTINCT invoiceno) AS order_count
FROM online_retail_data
GROUP BY country
ORDER BY order_count DESC;
""", engine)

                 country  order_count
0         United Kingdom        23494
1                Germany          603
2                 France          461
3                   EIRE          360
4                Belgium          119
5                  Spain          105
6            Netherlands          101
7            Switzerland           74
8               Portugal           71
9              Australia           69
10                 Italy           55
11               Finland           48
12                Sweden           46
13                Norway           40
14       Channel Islands           33
15                 Japan           28
16                Poland           24
17               Denmark           21
18                Cyprus           20
19               Austria           19
20             Hong Kong           15
21           Unspecified           13
22             Singapore           10
23                 Malta           10
24                Israel            9
25                   USA            7
26               Iceland            7
27                Greece            6
28                Canada            6
29    European Community            5
30        Czech Republic            5
31               Bahrain            4
32             Lithuania            4
33  United Arab Emirates            3
34          Saudi Arabia            2
35                Brazil            1
36                   RSA            1
37               Lebanon            1

In [8]:
# Query 3: Total Items Sold per Product
pd.read_sql("""
SELECT stockcode, SUM(quantity) AS total_sold
FROM online_retail_data
GROUP BY stockcode
ORDER BY total_sold DESC;
""", engine)

     stockcode  total_sold
0        22197     56450.0
1        84077     53847.0
2       85099B     47363.0
3       85123A     38830.0
4        84879     36221.0
...        ...         ...
4065   79323LP     -2618.0
4066    79323W     -4838.0
4067    72140F     -5368.0
4068     23003     -8516.0
4069     23005    -14418.0

[4070 rows x 2 columns]

In [9]:
# Query 4: List of Cancelled Orders
pd.read_sql("""
SELECT *
FROM online_retail_data
WHERE iscancelled = true;
""", engine)

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country,revenue,yearmonth,iscancelled
0,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom,-27.50,2010-12,True
1,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311.0,United Kingdom,-4.65,2010-12,True
2,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548.0,United Kingdom,-19.80,2010-12,True
3,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,-6.96,2010-12,True
4,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom,-6.96,2010-12,True
...,...,...,...,...,...,...,...,...,...,...,...
9283,C581490,23144,ZINC T-LIGHT HOLDER STARS SMALL,-11,2011-12-09 09:57:00,0.83,14397.0,United Kingdom,-9.13,2011-12,True
9284,C581499,M,Manual,-1,2011-12-09 10:28:00,224.69,15498.0,United Kingdom,-224.69,2011-12,True
9285,C581568,21258,VICTORIAN SEWING BOX LARGE,-5,2011-12-09 11:57:00,10.95,15311.0,United Kingdom,-54.75,2011-12,True
9286,C581569,84978,HANGING HEART JAR T-LIGHT HOLDER,-1,2011-12-09 11:58:00,1.25,17315.0,United Kingdom,-1.25,2011-12,True
9287,C581569,20979,36 PENCILS TUBE RED RETROSPOT,-5,2011-12-09 11:58:00,1.25,17315.0,United Kingdom,-6.25,2011-12,True

In [10]:
# Query 5: Monthly Revenue Trend
pd.read_sql("""
SELECT yearmonth, ROUND(SUM(revenue)::numeric, 2) AS monthly_revenue
FROM online_retail_data
WHERE iscancelled = false
GROUP BY yearmonth
ORDER BY yearmonth;
""", engine)

   yearmonth  monthly_revenue
0    2010-12        823746.14
1    2011-01        691364.56
2    2011-02        523631.89
3    2011-03        717639.36
4    2011-04        537808.62
5    2011-05        770536.02
6    2011-06        761739.90
7    2011-07        719221.19
8    2011-08        737014.26
9    2011-09       1058590.17
10   2011-10       1154979.30
11   2011-11       1509496.33
12   2011-12        638792.68

In [11]:
# Query 6: Customer Lifetime Value
pd.read_sql("""
SELECT customerid, ROUND(SUM(revenue)::numeric, 2) AS lifetime_value
FROM online_retail_data
WHERE iscancelled = false AND customerid IS NOT NULL
GROUP BY customerid
ORDER BY lifetime_value DESC
LIMIT 10;
""", engine)

   customerid  lifetime_value
0     14646.0       280206.02
1     18102.0       259657.30
2     17450.0       194550.79
3     16446.0       168472.50
4     14911.0       143825.06
5     12415.0       124914.53
6     14156.0       117379.63
7     17511.0        91062.38
8     16029.0        81024.84
9     12346.0        77183.60

In [12]:
# Query 7: Revenue by Country (Excluding UK)
pd.read_sql("""
SELECT country, SUM(revenue) AS total_revenue
FROM online_retail_data
WHERE iscancelled = false AND country != 'United Kingdom'
GROUP BY country
ORDER BY total_revenue DESC;
""", engine)

                 country  total_revenue
0            Netherlands      285446.34
1                   EIRE      283453.96
2                Germany      228867.14
3                 France      209715.11
4              Australia      138521.31
5                  Spain       61577.11
6            Switzerland       57089.90
7                Belgium       41196.34
8                 Sweden       38378.33
9                  Japan       37416.37
10                Norway       36165.44
11              Portugal       33747.10
12               Finland       22546.08
13             Singapore       21279.29
14       Channel Islands       20450.44
15               Denmark       18955.34
16                 Italy       17483.24
17             Hong Kong       15691.80
18                Cyprus       13590.38
19               Austria       10198.68
20                Israel        8135.26
21                Poland        7334.65
22                Greece        4760.52
23           Unspecified        4749.79
24               Iceland        4310.00
25                Canada        3666.38
26                   USA        3580.39
27                 Malta        2725.59
28  United Arab Emirates        1902.28
29               Lebanon        1693.88
30             Lithuania        1661.06
31    European Community        1300.25
32                Brazil        1143.60
33                   RSA        1002.31
34        Czech Republic         826.74
35               Bahrain         754.14
36          Saudi Arabia         145.92

In [13]:
# Query 8: Average Order Value
pd.read_sql("""
SELECT ROUND(AVG(order_total)::numeric, 2) AS avg_order_value
FROM (
  SELECT invoiceno, SUM(revenue) AS order_total
  FROM online_retail_data
  WHERE iscancelled = false
  GROUP BY invoiceno
) AS order_summary;
""", engine)

   avg_order_value
0           482.44

In [14]:
# Query 9: Segment Orders by High/Low Spend
pd.read_sql("""
SELECT invoiceno,
       SUM(revenue) AS order_value,
       CASE
         WHEN SUM(revenue) > 500 THEN 'High Value'
         ELSE 'Regular'
       END AS order_segment
FROM online_retail_data
WHERE iscancelled = false
GROUP BY invoiceno;
""", engine)

      invoiceno  order_value order_segment
0        536365       139.12       Regular
1        536366        22.20       Regular
2        536367       278.73       Regular
3        536368        70.05       Regular
4        536369        17.85       Regular
...         ...          ...           ...
22059    581586       339.20       Regular
22060    581587       249.45       Regular
22061   A563185     11062.06    High Value
22062   A563186    -11062.06       Regular
22063   A563187    -11062.06       Regular

[22064 rows x 3 columns]

In [15]:
# Query 10: Most Frequently Returned Products
pd.read_sql("""
SELECT description, COUNT(*) AS return_count
FROM online_retail_data
WHERE iscancelled = true
GROUP BY description
ORDER BY return_count DESC
LIMIT 10;
""", engine)

                         description  return_count
0                             Manual           244
1           REGENCY CAKESTAND 3 TIER           181
2                            POSTAGE           126
3           JAM MAKING SET WITH JARS            87
4                           Discount            77
5  SET OF 3 CAKE TINS PANTRY DESIGN             74
6                            SAMPLES            61
7     STRAWBERRY CERAMIC TRINKET BOX            55
8   ROSES REGENCY TEACUP AND SAUCER             54
9    RECIPE BOX PANTRY YELLOW DESIGN            47

In [16]:
# Query 11: Most Active Buying Hours
pd.read_sql("""
SELECT EXTRACT(HOUR FROM invoicedate::timestamp) AS hour,
       COUNT(*) AS order_count
FROM online_retail_data
WHERE iscancelled = false
GROUP BY hour
ORDER BY hour;
""", engine)

    hour  order_count
0    6.0            1
1    7.0          379
2    8.0         8807
3    9.0        33807
4   10.0        48028
5   11.0        56481
6   12.0        77371
7   13.0        71196
8   14.0        66448
9   15.0        76626
10  16.0        53597
11  17.0        27798
12  18.0         7764
13  19.0         3516
14  20.0          802

In [17]:
# Query 12: Top 3 Customers by Country (Window Function)
pd.read_sql("""
SELECT country, customerid, total_spent FROM (
  SELECT country, customerid,
         SUM(revenue) AS total_spent,
         RANK() OVER (PARTITION BY country ORDER BY SUM(revenue) DESC) AS rnk
  FROM online_retail_data
  WHERE iscancelled = false AND customerid IS NOT NULL
  GROUP BY country, customerid
) AS ranked
WHERE rnk <= 3;
""", engine)

        country  customerid  total_spent
0     Australia     12415.0    124914.53
1     Australia     12431.0      5514.67
2     Australia     12388.0      2780.66
3       Austria     12360.0      2662.06
4       Austria     12865.0      1568.23
..          ...         ...          ...
85  Unspecified     12363.0       552.00
86  Unspecified     12743.0       546.43
87          USA     12607.0      1579.51
88          USA     12646.0      1346.97
89          USA     12733.0       383.95

[90 rows x 3 columns]

In [18]:
# Query 13: Top 10 Countries by Revenue (Excluding UK)
pd.read_sql("""
SELECT Country, ROUND(SUM(Revenue)::numeric, 2) AS TotalRevenue
FROM online_retail_data
WHERE Country != 'United Kingdom' AND IsCancelled = false
GROUP BY Country
ORDER BY TotalRevenue DESC
LIMIT 10;
""", engine)

       country  totalrevenue
0  Netherlands     285446.34
1         EIRE     283453.96
2      Germany     228867.14
3       France     209715.11
4    Australia     138521.31
5        Spain      61577.11
6  Switzerland      57089.90
7      Belgium      41196.34
8       Sweden      38378.33
9        Japan      37416.37

In [19]:
# Query 14: Repeat vs One-Time Customers
pd.read_sql("""
SELECT
  CASE
    WHEN InvoiceCount = 1 THEN 'One-Time'
    ELSE 'Repeat'
  END AS CustomerType,
  COUNT(*) AS NumCustomers
FROM (
  SELECT CustomerID, COUNT(DISTINCT InvoiceNo) AS InvoiceCount
  FROM online_retail_data
  WHERE IsCancelled = false AND CustomerID IS NOT NULL
  GROUP BY CustomerID
) AS sub
GROUP BY CustomerType;
""", engine)

  customertype  numcustomers
0     One-Time          1494
1       Repeat          2845

In [20]:
# Query 15: Cancellation Rate by Country
pd.read_sql("""
SELECT Country,
       COUNT(*) AS TotalOrders,
       COUNT(CASE WHEN IsCancelled THEN 1 END) AS CancelledOrders,
       ROUND(COUNT(CASE WHEN IsCancelled THEN 1 END)::numeric * 100 / COUNT(*), 2) AS CancelRate
FROM online_retail_data
GROUP BY Country
ORDER BY CancelRate DESC
LIMIT 10;
""", engine)

          country  totalorders  cancelledorders  cancelrate
0             USA          291              112       38.49
1  Czech Republic           30                5       16.67
2           Malta          127               15       11.81
3           Japan          358               37       10.34
4    Saudi Arabia           10                1       10.00
5       Australia         1259               74        5.88
6           Italy          803               45        5.60
7         Bahrain           19                1        5.26
8         Germany         9495              453        4.77
9            EIRE         8196              302        3.68